
/*ЗАДАЧА:
Написать программу, которая из имеющегося массива строк формирует массив из строк, 
длина которых меньше либо равна 3 символа. 
Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. 
При решение не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.
*/

/* Что нужно сделать:
1. Предложить пользователю ввести количество элементов для обрабатываемого массива данных, применяя Console.Write.
2. Запомним указанное значение пользователем и запишем его в переменную. 
3. Исходя из указанного кол-ва элементов, предложить пользователю ввести сами значения столько раз, сколько он указал. 
   Используя цикл for и счетчик, записать значения в элементы массива.
4. Создать второй массив той же длины, которую указал пользователь.
5. Используя цикл for и счетчик, проверить значение каждого элемента на соответствие условию задачи, 
   при соответствии условии записать это значение в элемент второго массива.
6. По окончанию проверки последнего элемента первого массива, вывести на экран все значения элементов второго массива.
7. Реализовать возможность повторения выполнения программы без ввода команды dotnet run
*/


